Revit 2027 API
PaperPlacementType Enumeration
 An enumerated type listing all Paper Placement types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PaperPlacementType
Public Enumeration PaperPlacementType
public enum class PaperPlacementType
type PaperPlacementType
Members
Member name | Value | Description
Center | 0 |  The type of Paper Placement is Center.
LowerLeft | 1 |  The type of Paper Placement is LowerLeft.
Margins | 1 |  The type of Paper Placement is Margins. It's obsolete, use LowerLeft instead.
See Also
Reference
Autodesk.Revit.DB Namespace